# Pagrindinis puslapis
[Nuoroda į Olego puslapį](https://docs.google.com/document/d/17xDV1KA8kTpYMzRITa4UPyauafZ_w8KdMh3NJ4ycck8/edit)

## Pirmas laboratorinis

* [Instrukcijos](https://klevas.mif.vu.lt/~baronas/dbvs/uzduot_1/informat1.htm): automatinis užduoties suformulavimas, reikalavimai, **nuorodos į papildomą informaciją**
* Laboratorinio šaltinis: [vadovėlio](https://klevas.mif.vu.lt/~baronas/dbvs/book/index.htm) 2 [skyrius](https://klevas.mif.vu.lt/baronas/dbvs/book/dbvs002.pdf).
* [Biblio DB aprašymas](https://klevas.mif.vu.lt/~baronas/dbvs/biblio/bibliosh.htm).

#### Lentelės schema
![](dbschema.png)
#### knyga
![](knyga.png)
#### autorius
![](autorius.png)
#### skaitytojas
![](skaitytojas.png)
#### egzempliorius
![](egzempliorius.png)

### Užduotys

1. **Visų egzempliorių, paimtų konkretaus skaitytojo, nurodyto jo numeriu, skaičius.**

/* Atvejis, kai įvedame pasirinktą skaitytojo numerį į dvi vietas */
SELECT 1000 AS skaitytojas,
       COUNT(*) AS paimta
FROM Egzempliorius
WHERE Egzempliorius.Skaitytojas = 1000;

/* Atvejis, kai įvedame pasirinktą skaitytojo numerį į vieną vietą naudodami kintamojo priskyrimą (bet neišvengiame laikinųjų lentelių) */ DO $$
DECLARE n integer;
BEGIN
    SELECT 1000 INTO n;
    DROP TABLE IF EXISTS tmp_table;
    CREATE TEMPORARY TABLE tmp_table AS
    SELECT n as skaitytojas, COUNT(*) as paimta FROM Egzempliorius WHERE Egzempliorius.Skaitytojas = 1000;
END $$;


SELECT *
FROM tmp_table;

2. **Konkretaus skaitytojo, nurodyto jo AK, kiekvieno skaitomo egzemplioriaus numeris ir paėmimo bei grąžinimo datos.**

SELECT Egzempliorius.Nr,
       TO_CHAR(Egzempliorius.Paimta, 'YYYY-MM-DD') AS Paimta,
       TO_CHAR(Egzempliorius.Grazinti, 'YYYY-MM-DD') AS Grazinti
FROM Egzempliorius,
     Skaitytojas
WHERE Egzempliorius.Skaitytojas = Skaitytojas.Nr
  AND Skaitytojas.AK='49903021111';

3. **Kiekvienam ISBN pirmųjų simbolių ketvertui visų knygų ir visų jų egzempliorių skaičiai.**

In [ ]:
SELECT SUBSTRING(Egzempliorius.ISBN, 1, 4) AS ISBN_pradzia,
       COUNT(Egzempliorius.Nr) AS egzemplioriai,
       COUNT(Egzempliorius.Nr) AS knygos
FROM Egzempliorius,
     Knyga
WHERE Egzempliorius.ISBN = Knyga.ISBN
GROUP BY ISBN_pradzia;

4. **Kiekvieneriems metams, kai buvo išleista bent viena knyga, pavadinimas ir ISBN tais metais išleistos knygos, kurios egzempliorių yra paimta daugiausiai.**

/* Laikinoje lentelėje yra paimtų knygų skaičius kiekvienam ISBN taip pat nurodant su ISBN susietą pavadinimą ir metus;
Toliau sprendžiame klausimą, kaip SELECT frazėje su grupavimu prijungti su ISBN susietus stulpelius 'pavadinimas' ir 'metai' pagal https://stackoverflow.com/a/14841015/3044825 siūlomą atsakymą*/


WITH paimtos AS
  (SELECT knyga.ISBN,
          pavadinimas,
          metai,
          COUNT(paimta) AS paimtu_kiekis
   FROM egzempliorius
   JOIN knyga ON knyga.ISBN=egzempliorius.ISBN
   WHERE paimta IS NOT NULL
     AND metai IS NOT NULL
   GROUP BY knyga.ISBN)
SELECT p1.isbn,
       p1.pavadinimas,
       p1.metai,
       p1.paimtu_kiekis
FROM paimtos p1
LEFT JOIN paimtos p2 ON p1.metai=p2.metai
AND p1.paimtu_kiekis<p2.paimtu_kiekis
WHERE p2.paimtu_kiekis IS NULL;

### Kitos problemos, susijusios su pirmu laboratoriniu

1. Pirmas uždavinys paskatino [pasidomėti](https://stackoverflow.com/questions/1490942/how-to-declare-a-variable-in-a-postgresql-query), kaip padaryti lentelę, kurioje rodo įvestą skaičių ir jo dažnumą lentelėje. Radau apėjimą, kuris naudoja DO komandą, veikiančią nuo Postgresql 9.0 versijos. Tačiau [SQL skriptas iš CodeSignal](https://app.codesignal.com/arcade/db/time-river-revisited/G9zoZjTzk6JpJGFbd), naudojamas priskyrimui, skiriasi.

##### Rextester

CREATE TABLE edges(node1 INTEGER, node2 INTEGER);
INSERT INTO edges VALUES
    (1, 3),
    (1, 5),
    (2, 3),
    (4, 3),
    (2, 5);
    
DO $$
DECLARE n integer;
BEGIN
    SELECT 5 INTO n;
    DROP TABLE IF EXISTS tmp_table;
    CREATE TEMPORARY TABLE tmp_table AS    
    SELECT n as vertex, COUNT(*) as degree FROM edges WHERE edges.node1 = n or edges.node2 = n;
END $$;
SELECT * FROM tmp_table;
/*SELECT n, COUNT(*) as degree FROM edges WHERE edges.node1 = n or edges.node2 = n; - netinka, n neapibrėžtas*/

##### Codesignal

CREATE PROCEDURE alarmClocks()
BEGIN
SET @n := 3;
SET @m := 10;
DROP TABLE IF EXISTS integers;
CREATE TEMPORARY TABLE integers(number INT);
	WHILE @n < @m DO
        INSERT INTO integers SELECT @n;
        SET @n := @n + 1;
    END WHILE;
SELECT * FROM integers;
END

2. Ketvirtame uždavinyje susidūriau su problema, kai neįmanoma vienu metu sugrupuoti lentelės pagal kažkurį stulpelį ir įterpti kitų stulpelių, nei tas, pagal kurį grupuojamos maksimalios reikšmės. 
Kitaip tariant, toks sprendimas netinka:

CREATE TABLE X(a INT, b INT, C INT);
INSERT INTO X(a, b, c) VALUES
(1, 1, 10),
(1, 2, 12),
(1, 3, 14),
(2, 1, 13),
(2, 2, 9),
(2, 3, 7);

SELECT a, b, MAX(c)
FROM X
GROUP BY a;

[Stackoverflow](https://stackoverflow.com/questions/3491329/group-by-with-maxdate) siūlo tokius sprendimo būdus:

##### Basic, multiple passes

In [ ]:
WITH Y AS
  (SELECT a, MAX(c) AS c
   FROM X
   GROUP BY a)
SELECT X.a, X.b, X.c
FROM X INNER JOIN Y ON (X.a = Y.a) AND (X.c=Y.c);

##### one pass, uses ranking

In [ ]:
With Y AS(
    SELECT a, b, c, 
    RANK() OVER (PARTITION BY a ORDER BY b DESC) d
    FROM X
    )
SELECT a, b, c
FROM Y
WHERE d = 1;

##### clever looks optimised but actually slow

SELECT Y.a, Y.b, Y.c
FROM X Y LEFT JOIN X Z
ON (Y.a = Z.a AND Y.c < Z.c)
WHERE Z.a IS NULL;

### Antras laboratorinis

* [Trigerio pavyzdys](https://stackoverflow.com/questions/9556474/how-do-i-automatically-update-a-timestamp-in-postgresql/9556527#9556527) + [paprastesnis pavyzdys](https://www.postgresqltutorial.com/creating-first-trigger-postgresql/)
* [Instrukcijos](https://docs.google.com/document/d/1WABh5bWES6Hz3qHXjd2P87JbFK6FV56znRiRuXEmKb0/edit), ką ten daryti
* Laboratorinio šaltinis: [vadovėlio](https://klevas.mif.vu.lt/~baronas/dbvs/book/index.htm) 2-9 skyriai.

### Medžiaga
* [Olego tutorialai](https://www.youtube.com/channel/UCmrFaH8yLvYGYpPLcUHdcaA/videos?view_as=subscriber)
* [Papildomas tekstinis tutorial](https://www.postgresqltutorial.com)
* [Nuoroda į formatavimą](https://sqlformat.org/)
* [Darbo aplinka užduotims atlikti](https://rextester.com/l/postgresql_online_compiler)
* [Codesignal arkada](https://app.codesignal.com/arcade)
* [Udemy kursai](https://www.udemy.com/course/the-ultimate-mysql-bootcamp-go-from-sql-beginner-to-expert/learn/lecture/6914144)

### Lentelių kūrimas ir duomenų bazės pildymas

#### Stud

CREATE TABLE Knyga (
    ISBN           CHAR(13)    NOT NULL,
    Pavadinimas  VARCHAR(32) NOT NULL,
    Leidykla       CHAR(12)    NOT NULL,
    Metai       SMALLINT    NOT NULL CONSTRAINT LeidimoMetai 
                                         CHECK(Metai > 1900 AND Metai < EXTRACT(YEAR FROM CURRENT_DATE) + 1),
    Puslapiai   SMALLINT    NOT NULL CONSTRAINT PuslapiuSkaicius CHECK(Puslapiai > 0 AND Puslapiai < 2000),
    Verte       DECIMAL(5,2) CONSTRAINT VertesDydis CHECK(Verte > 0 AND Verte < 1000),
    PRIMARY KEY (ISBN)
);

CREATE TABLE Autorius (
    ISBN        CHAR(13)    NOT NULL,
    Vardas      CHAR(12)    NOT NULL,
    Pavarde     VARCHAR(20) NOT NULL,
    PRIMARY KEY (ISBN,Vardas,Pavarde),
    CONSTRAINT IKyga FOREIGN KEY (ISBN) REFERENCES Knyga ON DELETE CASCADE ON UPDATE RESTRICT
);

CREATE TABLE Skaitytojas (
    Nr          INTEGER     NOT NULL,
    AK          CHAR(11)    NOT NULL,
    Vardas      CHAR(12)    NOT NULL,
    Pavarde     VARCHAR(20) NOT NULL,
    Gimimas     DATE        NOT NULL,
    Adresas     VARCHAR(32),
    PRIMARY KEY (Nr)
);

CREATE TABLE Egzempliorius (
    Nr            INTEGER     NOT NULL,
    ISBN        CHAR(13)    NOT NULL,
    Skaitytojas INTEGER,
    Paimta       DATE,
    Grazinti     DATE,
    PRIMARY KEY (Nr),
    CONSTRAINT IKnyga FOREIGN KEY (ISBN)             REFERENCES Knyga       ON DELETE CASCADE ON UPDATE RESTRICT,
    CONSTRAINT ISkaitytoja FOREIGN KEY (Skaitytojas) REFERENCES Skaitytojas ON DELETE RESTRICT ON UPDATE RESTRICT,
    CONSTRAINT  GrazintiVeliau CHECK(Grazinti >= Paimta) 
);

INSERT INTO Knyga(ISBN, Pavadinimas, Leidykla, Metai, Puslapiai, Verte) VALUES
    ('9998-01-101-9','Duomenu bazes', 'Baltoji', 2005, 212, NULL ),
    ('9998-01-102-7','Programavimo kalbos', 'Baltoji', 2006, 401, 22.50),
    ('9999-02-202-2','Operacines sistemos', 'Juodoji', 2006, 356, 19.90),
    ('9999-02-203-0','Transliavimo metodai', 'Juodoji', 2007, 495, 30.00),
    ('9998-01-103-5','Objektinis programavimas','Baltoji', 2006, 356, 19.90),
    ('9997-03-303-5','Informacines sistemos', 'Raudonoji', 2006, 254, 15.50),
    ('9998-01-104-3','Kompiuteriu tinklai', 'Baltoji', 2007, 455, 35.20);

INSERT INTO Autorius(ISBN,Vardas,Pavarde) VALUES
    ('9998-01-101-9', 'Jonas', 'Jonaitis' ),
    ('9998-01-101-9', 'Petras', 'Petraitis' ),
    ('9998-01-102-7', 'Pijus', 'Jonaitis' ),
    ('9999-02-202-2', 'Pijus', 'Jonaitis' ),
    ('9999-02-202-2', 'Onute', 'Jonaityte' ),
    ('9999-02-202-2', 'Jonas', 'Petraitis' ),
    ('9999-02-202-2', 'Jonas', 'Jonaitis' ),
    ('9999-02-203-0', 'Juozas', 'Juodakis' ),
    ('9999-02-203-0', 'Antanas', 'Antanaitis'),
    ('9998-01-103-5', 'Maryte', 'Grazulyte' ),
    ('9998-01-103-5', 'Janina', 'Jonaityte' ),
    ('9997-03-303-5', 'Simas', 'Simaitis' ),
    ('9997-03-303-5', 'Petras', 'Petraitis' ),
    ('9997-03-303-5', 'Simas', 'Baltakis' ),
    ('9998-01-104-3', 'Jonas', 'Petraitis' );

    
INSERT INTO Skaitytojas(Nr, AK, Vardas, Pavarde, Gimimas, Adresas) VALUES
    (1000, '50101010222', 'Jonas', 'Petraitis', '2001-01-01', 'Tiesioji 1-10' ),
    (1001, '39902200102', 'Jonas', 'Onaitis', '1999-02-28', 'Lenktoji 20' ),
    (1010, '49903021111', 'Milda', 'Onaityte', '1999-03-02', 'Didzioji 21-5' ),
    (1015, '49906301011', 'Onute', 'Petraityte','1999-06-30', 'Didzioji 21-5' ),
    (1021, '39905301031', 'Petras', 'Jonaitis', '1999-05-30', 'Mazoji 1' ),
    (1032, '39912310031', 'Tadas', 'Onaitis', '1999-12-31', 'Tiesioji 12' ),
    (1033, '49911300131', 'Grazina', 'Petraityte','1999-11-30', 'Tiesioji 1-10' ),
    (1011, '50111010055', 'Jonas', 'Adomaitis','2001-01-01', 'Mazoji 1' );

INSERT INTO Egzempliorius(Nr, ISBN, Skaitytojas, Paimta, Grazinti) VALUES
    (32101, '9998-01-101-9', NULL, NULL, NULL ),
    (32102, '9998-01-101-9', NULL, NULL, NULL ),
    (32103, '9998-01-101-9', NULL, NULL, NULL ),
    (32104, '9998-01-101-9', 1000, '2019-10-02', '2019-10-05' ),
    (32105, '9998-01-101-9', 1010, '2019-09-04', '2019-10-04' ),
    (32106, '9998-01-101-9', 1021, '2019-09-14', '2019-10-04' ),
    (32107, '9998-01-101-9', NULL, NULL, NULL ),
    (32108, '9998-01-101-9', 1001, '2019-10-02', '2019-10-14' ),
    (32109, '9998-01-101-9', 1032, '2019-09-20', '2019-10-05' ),

    (32200, '9998-01-102-7', NULL, NULL, NULL ),
    (32201, '9998-01-102-7', 1021, '2019-10-02', '2019-11-04' ),

    (32301, '9999-02-202-2', 1000, '2019-10-02', '2019-10-15' ),
    (32302, '9999-02-202-2', 1021, '2019-09-14', '2019-10-04' ),
    (32303, '9999-02-202-2', NULL, NULL, NULL ),

    (32330, '9999-02-203-0', NULL, NULL, NULL ),
    (32331, '9999-02-203-0', NULL, NULL, NULL ),
    (32332, '9999-02-203-0', 1010, '2019-09-14', '2019-10-05' ),
    (32333, '9999-02-203-0', 1015, '2019-10-14', '2019-11-05' ),

    (32401, '9998-01-103-5', NULL, NULL, NULL ),
    (32402, '9998-01-103-5', 1032, '2019-09-20', '2019-10-05' ),
    (32403, '9998-01-103-5', NULL, NULL, NULL ),
    (32404, '9998-01-103-5', NULL, NULL, NULL ),
    (32405, '9998-01-103-5', NULL, NULL, NULL ),
    (32406, '9998-01-103-5', 1010, '2019-09-14', '2019-10-04' ),

    (32501, '9997-03-303-5', 1010, '2019-10-14', '2019-11-04' ),
    (32502, '9997-03-303-5', 1032, '2019-09-20', '2019-10-04' ),
    (32503, '9997-03-303-5', 1015, '2019-09-20', '2019-10-05' ),
    (32504, '9997-03-303-5', 1001, '2019-10-06', '2019-11-05' ),

    (32601, '9998-01-104-3', NULL, NULL, NULL ),
    (32602, '9998-01-104-3', NULL, NULL, NULL ),
    (32603, '9998-01-104-3', NULL, NULL, NULL ),
    (32604, '9998-01-104-3', NULL, NULL, NULL ),
    (32605, '9998-01-104-3', NULL, NULL, NULL );

#### Darbai

CREATE SCHEMA Darbai;

CREATE TABLE Vykdytojai(
    Nr INT,
    Pavardė VARCHAR(30),
    Kvalifikacija VARCHAR(30),
    Kategorija INT,
    Išsilavinimas VARCHAR(30)
);

CREATE TABLE Projektai(
    Nr INTEGER,
    Pavadinimas VARCHAR(30),
    Svarba VARCHAR(30),
    Pradžia DATE,
    Trukmė INTEGER
);

CREATE TABLE Vykdymas(
    Projektas INTEGER,
    Vykdytojas INTEGER,
    Statusas VARCHAR(30),
    Valandos INTEGER
);

INSERT INTO Vykdytojai(Nr, Pavardė, Kvalifikacija, Kategorija, Išsilavinimas) VALUES
    (1, 'Jonaitis', 'Informatikas', 2, 'VU'),
    (2, 'Petraitis', 'Statistikas', 3, 'VU'),
    (3, 'Gražulytė', 'Inžinierius', 1, NULL),
    (4, 'Onaitytė', 'Vadybininkas', 5, 'VDU'),
    (5, 'Antanaitis', 'Informatikas', 3, 'VU');

INSERT INTO Projektai VALUES
    (1, 'Studentų apskaita', 'Maža', '2017-01-01', 12),
    (2, 'Buhalterinė apskaita', 'Vidutinė', '2017-03-01', 10),
    (3, 'WWW svetainė', 'Didelė', '2017-06-01', 2);

INSERT INTO Vykdymas VALUES
    (1, 1, 'Programuotojas', 30),
    (1, 2, 'Dokumentuotojas', 100),
    (1, 3, 'Testuotojas', 100),
    (1, 4, 'Vadovas', 100),
    (2, 1, 'Programuotojas', 300),
    (2, 2, 'Analitikas', 250),
    (2, 4, 'Vadovas', 100),
    (3, 1, 'Programuotojas', 250),
    (3, 2, 'Vadovas', 400),
    (3, 3, 'Dizaineris', 150);

SELECT * FROM Vykdymas;

### Codesignal aplinka

CREATE PROCEDURE salaryDifference()
BEGIN
DROP TABLE IF EXISTS Vykdytojai;
DROP TABLE IF EXISTS Projektai;
DROP TABLE IF EXISTS Vykdymas;
...
END

### Egzamino temos
* DB ir DBVS samprata, paskirtis ir funkcijos.
* Pagrindinės reliacinio duomenų modelio sąvokos.
* Reliacinių DB projektavimas: ER modelis, ER diagramos, jų transformavimas į reliacinį duomenų modelį.
* DB norminės formos.
* SQL kalba: pagrindiniai kalbos elementai, duomenų apibrėžimo, išrinkimo, modifikavimo ir valdymo sakiniai.
* Duomenų analizė agreguojant ir grupuojant duomenis.
* Duomenų vientisumo užtikrinimas: reikalavimai reikšmėms, lentelių raktai, išoriniai raktai, dalykinės taisyklės, trigeriai, transakcijos.
* Virtualiosios lentelės.
* Duomenų indeksavimas.
* Duomenų saugumas.
* Efektyvaus DBVS funkcionavimo užtikrinimas.
* NoSQL ir NewSQL DBVS.

In [3]:
### Bankas
d = dict()
d['ER modelis'] = 'formalizuotas dalykinės srities aprašas'
d['Esybė'] = 'vienatipių objektų klasė'
from random import shuffle
unans = [n for n in d]
while len(unans):
    X = len(unans)
    shuffle(unans)
    for i in range(len(unans)-1,-1,-1):
        x = input(unans[i]+' ')
        if x != d[unans[i]].lower():
            print(f'wrong, {unans[i]} yra {d[unans[i]]}')
        else: 
            print('right')
            del unans[i]
        if x=='': break
    print(f'{len(unans)}/{X} is left')
print('all clear')

ER modelis
wrong, ER modelis yra formalizuotas dalykinės srities aprašas

TypeError: unsupported operand type(s) for /: 'int' and 'set'